An enumerated type listing all fabrication ancillary types.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
  Since:  2017 Subscription Update
 Syntax
  C#
public enum FabricationAncillaryType
  Visual Basic
Public Enumeration FabricationAncillaryType
  Visual C++
public enum class FabricationAncillaryType
 Members
  Member name  |   Description
   Unknown   |   Unknown or unsupported ancillary type.
   Fixing   |   Ancillary nuts and bolts. Used to fix and bind other ancillaries.
   Corner   |   Ancillary corner joints. Used to join ancillary materials."
   Clip   |   Ancillary clips and washers. Used to additionally fix and clip ancillaries together.
   TieRod   |   Ancillary tie rod types. Used to internally stiffen fittings.
   Gasket   |   Ancillary gaskets. Used to seal connector joints.
   Sealant   |   Ancillary sealants. Used to seal seams.
   SupportRod   |   Ancillary support drop rod types. Used to support fittings.
   AncillaryMaterial   |   Ancillary materials used to support and externally stiffen fittings, eg. angle iron, unistrut.
   AirturnTrack   |   Ancillary airturn tracks. Used to fasten airturn vanes in place.
   AirturnVane   |   Ancillary airturn vanes. Used to manage flow through fittings.
   Isolator   |   Ancillary support isolators. Used inline ancillary support rods.
 See Also
  Autodesk.Revit.DB.Fabrication Namespace